perf/spike/exchange.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Baseline
      duration: 30
      arrivalRate: 20
    - name: Spike Light
      duration: 10
      arrivalRate: 1000
    - name: Spike Medium
      duration: 10
      arrivalRate: 1500
    - name: Recovery
      duration: 30
      arrivalRate: 50


scenarios:
  - name: Exchange ARS -> USD (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAmount: 10.0
            baseAccountId: 1
            counterAccountId: 2

  - name: Exchange ARS -> EUR (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAmount: 10.0
            baseAccountId: 1
            counterAccountId: 3

  - name: Exchange ARS -> BRL (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "BRL"
            baseAmount: 10.0
            baseAccountId: 1
            counterAccountId: 4

  - name: Exchange USD -> ARS (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1.0
            baseAccountId: 2
            counterAccountId: 1

  - name: Exchange EUR -> ARS (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAmount: 10.0
            baseAccountId: 3
            counterAccountId: 1

  - name: Exchange BRL -> ARS (/exchange)
    weight: 16
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "BRL"
            counterCurrency: "ARS"
            baseAmount: 5.0
            baseAccountId: 4
            counterAccountId: 1